# ProfileFlipAlong Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PartMakerMethodToDivideVolumes..::..ProfileFlipAlong Property
PartMakerMethodToDivideVolumes Class See Also
---
True if the corresponding left/upper parts profile are mirrored with respect to the center line of the hosts to be divided. False if the profile of left/upper parts are defined directly by the profile family.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public bool ProfileFlipAlong { get; set; }
```

Visual Basic
---
```text
Public Property ProfileFlipAlong As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool ProfileFlipAlong {
	bool get ();
	void set (bool value);
}
```

# See Also
PartMakerMethodToDivideVolumes Class
Autodesk.Revit.DB Namespace